app/controllers/articles_controller.rb

    def index
        @articles = Article.paginate(page: params[:page], per_page: 5)
---
SELECT "articles".* FROM "articles" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles"

    def create
        @article = Article.new(article_params)
        if @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "Article10"], ["description", "article 10100101010"], ["created_at", "2024-04-17 14:02:55.671570"], ["updated_at", "2024-04-17 14:02:55.671570"]]

    def update
      if @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Article 01"], ["description", "this is article 01"], ["updated_at", "2024-04-17 14:05:27.201781"], ["id", 12]]

    def destroy
      @article.destroy
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 2]]

    def set_article
      @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]