app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"
---
  def index
    @users  = User.paginate(page: params[:page], per_page: 5)

SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 8], ["LIMIT", 5], ["OFFSET", 0]]
---
  def show
    @articles = @user.articles.paginate(page: params[:page], per_page: 5)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 8]]
---
  def destroy
    @user.destroy

INSERT INTO "users" ("username", "created_at", "updated_at", "email", "password_digest") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["username", "Seep"], ["created_at", "2024-04-19 11:34:02.917364"], ["updated_at", "2024-04-19 11:34:02.917364"], ["email", "seep@exemple.com"], ["password_digest", "[FILTERED]"]]
---
  def create
   @user = User.new(user_params)
   if @user.save